<?php
return [
  'database_list' => [
    'mysql' => '正式账套', 'test' => '测试账套'
  ],
  'img_config' => [
    'enterprice' => [
      'SHTXD' => '随货通行单',
      'YZYSTP' => '印章样式图片'
    ],
    'providersImg' => [
      'YYZZ' => '营业执照',
      'GSP_GMP' => 'GSP/GMP证书',
      'ZZJGDMZ' => '组织机构代码证',
      'YPJYXKZ' => '药品经营许可证',
      'BJPJYXKZ' => '保健品经营许可证',
      'YLQXJYXKZ' => '医疗器械经营许可证',
      'SPJYXKZ' => '食品经营许可证',
      'YWSQS' => '业务授权书',
      'ZLBZS' => '质量保证书',
      'ZGZS' => '资格证书',
      'FRWTS' => '法人委托书',
      'SHTXD' => '随货通行单',
      'YZYSTP' => '印章样式图片'
    ],
    'goods' => [
      'SCQYYYZZ' => '生产企业营业执照',
      'GMP' => 'GMP证书',
      'SCXKZ' => '生产许可证',
      'ZLZS' => '质量证书',
      'ZCSB' => '注册商标'
    ],
    'customer' => [
      'YYZZ' => '营业执照',
      'GSP' => 'GSP证书',
      'ZZJGDMZ' => '组织机构代码证',
      'YPJYXKZ' => '药品经营许可证',
      'BJPJYXKZ' => '保健品经营许可证',
      'YLQXJYXKZ' => '医疗器械经营许可证',
      'SPJYXKZ' => '食品经营许可证',
      'YWSQS' => '业务授权书',
      'YLXKZ' => '医疗许可证',
      'FRWTS' => '法人委托书'
    ]
  ],
  'enterprise_type' => [
    '商品生产企业', '非商品生产企业', '商品经营企业', '非商品经营企业', '药品生产企业', '药品批发企业', '医疗器械生产企业', '医疗器械批发企业', '保健食品生产企业', '保健食品批发企业'
  ],
  'edu' => [
    '小学', '初中', '中专', '高中', '专科', '本科', '研究生', '博士'
  ],
  /** gsp验收类型 **/
  'gsp_category' => [
    1 => '普通药品', 2 => '进口药品', 3 => '医疗器械', 4 => '中药饮片', 5 => '特殊药品', 6 => '非药品'
  ],
  /** 商品成份类别 **/
  'element_type' => [
    '鞣制', '钙', '钛镁铝鈊', '碱性', '酸性', '槲皮素', '利胆药含胆汁制剂', '瑞香素', '乙醇', '麻黄素', '生物碱', '甙类', '汞', '砷', '钾', '碘', '抗组织胺', '促放组织胺', '淀粉酶', '炭制剂', '青霉素类', '头孢菌素类', '氨基糖苷类', '大环内酯类', '四环素类', '氯霉素', '喹诺酮类', '磺胺类', '抗菌增效剂', '洁霉素类', '多黏菌素类', '抗病毒类', '抗寄生虫药', '助消化与健胃药', '平喘药', '维生素类', '消毒防腐类'
  ],
  /** 商品色标 **/
  'color_type' => [
    '红色', '黄色', '绿色', '蓝色', '青色', '橙色', '黑色', '紫色'
  ],
  /** 储存条件 **/
  'storage' => [
    '常温储存', '阴凉储存', '冷藏储存'
  ],
  'ware_type'=>[
    '成品仓','原料仓'
  ],
  /** 等级 **/
  'level' => [
    '一级品', '二级品', '三级品', '合格品'
  ],
  /** 采购方式 **/
  'purch_type' => [
    '购销', '代销'
  ],
  /** 养护方式 **/
  'tend_type' => [
    '重点养护', '普通养护', '中药养护', '特殊药品养护'
  ],
  /** 客户类型 **/
  'custom_type' => [
    '药品生产企业', '药品批发企业', '药品零售企业', '医院', '妇幼保健院', '疾病预防控制中心', '防疫站', '血防站', '乡镇卫生站', '村卫生室', '社区卫生服务机构', '计生服务站', '戒毒所', '门诊部', '个体诊所', '医务室', '药品研发单位', '药品教学单位'
  ],
  /** 商品计量单位 **/
  'goods_unit' => [
    '把', '包', '袋', '对', '个', '合', '盒', '件', '克', '粒', '片', '瓶', '千克', '条', '箱', '支', '只'
  ],
  /** 剂型 **/
  'dosage' => [
    '搽剂', '滴鼻剂', '滴眼剂', '酊剂', '混悬剂', '胶囊剂', '酒剂', '颗粒剂', '口服溶液', '膜剂', '凝胶剂', '喷雾剂', '片剂', '气粉雾剂', '乳剂', '软膏剂', '散剂', '栓剂', '糖浆剂', '透皮贴剂', '丸剂', '洗剂', '眼膏剂', '注射剂'
  ],
  /** 保质期单位 **/
  'shelf_unit' => [
    '年', '月', '日'
  ],
  'billing_type' => [
    '普通发票', '增值税专用发票', '电子发票'
  ],
  'abc_type' => [
    'A', 'B', 'C'
  ],
  'ml_type' => [
    'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J'
  ],

  /** 采购计划类型 **/
  'plan_type' => [
    '常规计划', '紧急计划'
  ],
  /** 合同类型 **/
  'contract_type' => [
    '计划合同', '追加合同', '电话合同', '电报合同', '传真合同', '进口合同'
  ],
  /** 货品状态 **/
  'goods_status' => [
    '合格', '样品', '质量抽样', '轻微变形', '药检缺失', '进货短少', '退货短少', '在库短少', '运输短少', '质量待查', '业务停销', '物流内部原因锁', '近效期', '在库过效期', '销退过效期', '隔离转不合格', '送(抽)检不合格', '进货污染、严重破损', '退货污染、严重破损', '在库污染、严重破损', '运输污染、严重破损', '标签、说明书规范', '药监局查封', '货主已报损待销毁', '物流已报损待销毁', '质量召回'
  ],
  /** 质量状态 **/
  'quality_status' => [
    '合格', '隔离', '不合格'
  ],
  'invoice_type' => [
    0 => '普通', 1 => '增值税'
  ],
  'pay_kind' => [
    0 => '实付', 1 => '预付'
  ],
  'check_default' => [
    'verify_report' => ['无', '有','待补'],
    'certificato' => ['无', '有'],
    'quality_state' => ['不合格', '合格'],
    'package_state' => ['不合格', '合格'],
    'label_state' => ['不合格', '合格'],
    'directions' => ['无', '有'],
    'check_verdict' => ['不合格', '部分合格', '合格'],
    'rejection_type'=>['0:直接拒收','1:先收货入库'],
    'entry_certificate'=>['无','有']
  ],
  'delivery_method' => [
      '公司送货','委托运输','客户自提'
  ],
  'delivery_level' => [
      '紧急发货','优先发货','正常发货'
  ],
  'ship_type' => [
      '陆运','冷藏陆运','空运','冷藏空运','水运','铁路'
  ],
  'detect_tache'=>[
    '验收环节','在库保管环节','在库养护环节','拣货发货环节','出库复核环节','运输环节','销后退回环节','其它环节',
  ],
  'cold_storage_measures'=>[
    '冷藏车','冷藏箱','保温箱',
  ]
];
